#!/bin/bash

#--------------------------------------------------#
# Скрипт создаёт каталог data с подкаталогами...
# Run: bash modules/tokenbox/bin/00-init.sh
#--------------------------------------------------#

TARGET_DIR=$(dirname "${BASH_SOURCE[0]}")          # Получить каталог, в котором находится запускаемый скрипт
MODULE_DIR=$(echo "$TARGET_DIR" | cut -d'/' -f-2)  # Обрезать путь до двух верхних уровней

source "$MODULE_DIR/config/dirs.sh"

#--------------------------------------------------#

mkdir -p "$DATA_TXT" "$DATA_CSV"

